class/2nov_plate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       19800;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       19900;
    }
    wall
    {
        type            patch;
        nFaces          100;
        startFace       20000;
    }
    center
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          20;
        startFace       20100;
    }
    plate
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       20120;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       20200;
    }
)

// ************************************************************************* //
